In [2]:
svc = "aa5c87b7224164f7fa35384e3087f010-1736237798.eu-west-1.elb.amazonaws.com"
url = f'bolt://{svc}:7687'

In [3]:
from py2neo import Graph,Node,Relationship
graph = Graph(url, auth=("neo4j", "password"))

In [4]:
graph.evaluate("MATCH (n) RETURN n")

In [5]:
graph.run("MATCH (n) RETURN n;").to_data_frame()

Empty DataFrame
Columns: []
Index: []

In [6]:
graph.evaluate("MATCH (n) DETACH DELETE n")

In [7]:
import pandas as pd
pd.set_option('display.max_colwidth', -1)

In [8]:
actors = [
'CREATE(: Actor{id: 1, name: "Keven Bacon", birth_date: "1958-07-08", birth_city: "Philalephia", birth_state: "PA"})',
'CREATE(: Actor{id: 2, name: "Tom Cruise", birth_date: "1962-07-03", birth_city: "Syracuse", birth_state: "NY"})',
'CREATE(: Actor{id: 3, name: "Tyrese Gibson", birth_date: "1978-12-30", birth_city: "Los Angeles", birth_state: "CA"})',
'CREATE(: Actor{id: 4, name: "John Turtumo", birth_date: "1957-02-28", birth_city: "Brooklyn", birth_state: "NY"})', 
'CREATE(: Actor{id: 5, name: "Vin Diesel", birth_date: "1967-07-18", birth_city: "Alameda County", birth_state: "CA"})'
]

for actor in actors:
    graph.evaluate(actor)
    
graph.run("MATCH (n) RETURN n;").to_data_frame()

                                                                                                                  n
0  {'name': 'Keven Bacon', 'birth_city': 'Philalephia', 'id': 1, 'birth_state': 'PA', 'birth_date': '1958-07-08'}
1  {'name': 'Tom Cruise', 'birth_city': 'Syracuse', 'id': 2, 'birth_state': 'NY', 'birth_date': '1962-07-03'}
2  {'name': 'Tyrese Gibson', 'birth_city': 'Los Angeles', 'id': 3, 'birth_state': 'CA', 'birth_date': '1978-12-30'}
3  {'name': 'John Turtumo', 'birth_city': 'Brooklyn', 'id': 4, 'birth_state': 'NY', 'birth_date': '1957-02-28'}
4  {'name': 'Vin Diesel', 'birth_city': 'Alameda County', 'id': 5, 'birth_state': 'CA', 'birth_date': '1967-07-18'}

In [10]:
graph.evaluate("MATCH (n) DETACH DELETE n")
actors = [
'MERGE(: Actor{id: 1, name: "Keven Bacon", birth_date: "1958-07-08", birth_city: "Philalephia", birth_state: "PA"})',
'MERGE(: Actor{id: 2, name: "Tom Cruise", birth_date: "1962-07-03", birth_city: "Syracuse", birth_state: "NY"})',
'MERGE(: Actor{id: 3, name: "Tyrese Gibson", birth_date: "1978-12-30", birth_city: "Los Angeles", birth_state: "CA"})',
'MERGE(: Actor{id: 4, name: "John Turtumo", birth_date: "1957-02-28", birth_city: "Brooklyn", birth_state: "NY"})', 
'MERGE(: Actor{id: 5, name: "Vin Diesel", birth_date: "1967-07-18", birth_city: "Alameda County", birth_state: "CA"})'
]

for cypher in actors:
    graph.run(cypher)
    
graph.run("MATCH (n) RETURN n;").to_data_frame()

                                                                                                                  n
0  {'name': 'Keven Bacon', 'birth_city': 'Philalephia', 'id': 1, 'birth_state': 'PA', 'birth_date': '1958-07-08'}
1  {'name': 'Tom Cruise', 'birth_city': 'Syracuse', 'id': 2, 'birth_state': 'NY', 'birth_date': '1962-07-03'}
2  {'name': 'Tyrese Gibson', 'birth_city': 'Los Angeles', 'id': 3, 'birth_state': 'CA', 'birth_date': '1978-12-30'}
3  {'name': 'John Turtumo', 'birth_city': 'Brooklyn', 'id': 4, 'birth_state': 'NY', 'birth_date': '1957-02-28'}
4  {'name': 'Vin Diesel', 'birth_city': 'Alameda County', 'id': 5, 'birth_state': 'CA', 'birth_date': '1967-07-18'}

In [11]:
movies = [
    'CREATE(: Movie{id: 1, name: "Fast Five", year: 2011}) '
    'CREATE(: Movie{id: 2, name: "Transformers: Revenge of the Fallen", year: 2019}) '
    'CREATE(: Movie{id: 3, name: "The Color of Moeny", year: 1986}) '
    'CREATE(: Movie{id: 4, name: "A Few Good Men", year: 1992})' 
]

for cypher in movies:
    graph.run(cypher)
graph.run("MATCH (n) RETURN n;").to_data_frame()

                                                                                                                  n
0  {'name': 'Fast Five', 'year': 2011, 'id': 1}
1  {'name': 'Transformers: Revenge of the Fallen', 'year': 2019, 'id': 2}
2  {'name': 'The Color of Moeny', 'year': 1986, 'id': 3}
3  {'name': 'A Few Good Men', 'year': 1992, 'id': 4}
4  {'name': 'Keven Bacon', 'birth_city': 'Philalephia', 'id': 1, 'birth_state': 'PA', 'birth_date': '1958-07-08'}
5  {'name': 'Tom Cruise', 'birth_city': 'Syracuse', 'id': 2, 'birth_state': 'NY', 'birth_date': '1962-07-03'}
6  {'name': 'Tyrese Gibson', 'birth_city': 'Los Angeles', 'id': 3, 'birth_state': 'CA', 'birth_date': '1978-12-30'}
7  {'name': 'John Turtumo', 'birth_city': 'Brooklyn', 'id': 4, 'birth_state': 'NY', 'birth_date': '1957-02-28'}
8  {'name': 'Vin Diesel', 'birth_city': 'Alameda County', 'id': 5, 'birth_state': 'CA', 'birth_date': '1967-07-18'}